fanCPU_CHT/0.orig/fluid/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O  peration    | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    inlet
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    
    fan
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    
    outlet
    {
        type            fixedValue;
        value           uniform 1e5;
    }
    
    walls
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
    
    "fluid_to_.*"
    {
        type            fixedFluxPressure;
        value           $internalField;
    }
}

// ************************************************************************* //
